In [13]:
import pandas as pd

df = pd.read_csv("csv_files/expanded_employee_data.csv")
df.head()

,EmployeeID,Name,Age,Department,Position,Salary,JoiningDate,Location,Experience,Performance,Gender,LeavesTaken,ProjectsHandled,RemoteWork
0,1,Employee_1,50,Finance,Executive,72254,2010-01-31,London,29,Good,Other,29,7,Yes
1,2,Employee_2,36,Finance,Assistant,87362,2010-02-28,Toronto,3,Excellent,Female,3,7,No
2,3,Employee_3,29,Finance,Manager,60128,2010-03-31,Sydney,34,Excellent,Male,1,4,Yes
3,4,Employee_4,42,HR,Manager,99383,2010-04-30,Berlin,27,Average,Female,19,13,Yes
4,5,Employee_5,40,HR,Engineer,105545,2010-05-31,New York,13,Average,Other,15,14,No

In [29]:
# Easy Tasks
# Load the dataset into pandas and display the first 10 rows.
# Check the shape (number of rows and columns).
# Get the list of column names.
# Find the average salary of all employees.
# Count how many employees are in each department.

clone_df = df.copy()
clone_df.head(10)
clone_df.shape
clone_df.columns.to_list()
# clone_df["Salary"].mean()
clone_df.loc[:,"Salary"].mean().round()
clone_df.groupby(by = "Department")["EmployeeID"].count()
clone_df["no_of_emp_in_each_department"] =  clone_df["Department"].value_counts()
clone_df

,EmployeeID,Name,Age,Department,Position,Salary,JoiningDate,Location,Experience,Performance,Gender,LeavesTaken,ProjectsHandled,RemoteWork,no_of_emp_in_each_department
0,1,Employee_1,50,Finance,Executive,72254,2010-01-31,London,29,Good,Other,29,7,Yes,NaN
1,2,Employee_2,36,Finance,Assistant,87362,2010-02-28,Toronto,3,Excellent,Female,3,7,No,NaN
2,3,Employee_3,29,Finance,Manager,60128,2010-03-31,Sydney,34,Excellent,Male,1,4,Yes,NaN
3,4,Employee_4,42,HR,Manager,99383,2010-04-30,Berlin,27,Average,Female,19,13,Yes,NaN
4,5,Employee_5,40,HR,Engineer,105545,2010-05-31,New York,13,Average,Other,15,14,No,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
295,296,Employee_296,53,Finance,Executive,79952,2034-08-31,Sydney,20,Good,Other,27,10,No,NaN
296,297,Employee_297,43,Marketing,Manager,62180,2034-09-30,New York,14,Poor,Male,24,8,No,NaN
297,298,Employee_298,44,Support,Analyst,118411,2034-10-31,London,2,Average,Other,12,8,No,NaN
298,299,Employee_299,23,Finance,Assistant,41622,2034-11-30,Sydney,9,Poor,Male,19,12,Yes,NaN
299,300,Employee_300,48,Marketing,Engineer,88756,2034-12-31,Toronto,20,Poor,Female,16,12,Yes,NaN